{"format": "graph-model", "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v1.7.2", "userDefinedMetadata": {"signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}}, "modelTopology": {"node": [{"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "7"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/point_in_sphere/Prelu/Neg", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/point_in_sphere/Dense/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/point_in_sphere/Dense/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/point_in_sphere/Output/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/point_in_sphere/Output/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/point_in_sphere/Dense/BiasAdd", "op": "_FusedMatMul", "input": ["input_1", "StatefulPartitionedCall/point_in_sphere/Dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/point_in_sphere/Dense/BiasAdd/ReadVariableOp", "StatefulPartitionedCall/point_in_sphere/Prelu/Neg"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "2"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UHJlbHU="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/point_in_sphere/Output/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/point_in_sphere/Dense/BiasAdd", "StatefulPartitionedCall/point_in_sphere/Output/MatMul/ReadVariableOp", "StatefulPartitionedCall/point_in_sphere/Output/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/point_in_sphere/Output/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/point_in_sphere/Output/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/point_in_sphere/Output/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/point_in_sphere/Prelu/Neg", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/point_in_sphere/Dense/MatMul/ReadVariableOp", "shape": [7, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/point_in_sphere/Dense/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/point_in_sphere/Output/MatMul/ReadVariableOp", "shape": [3, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/point_in_sphere/Output/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}